--- a/source/_posts/Design-pattern-iterator.md
+++ b/source/_posts/Design-pattern-iterator.md
@@ -16,6 +16,91 @@ it also places the task of traveral(遍历) on the iterator object, not on the a
 
+## UML
+
+```plantuml
+@startuml
+skinparam linetype ortho
+
+Interface Aggregate {
+	+Iterator createIterator()
+}
+
+Interface Iterator {
+	+Object next()
+    +boolean hasNext()
+}
+
+class ConcreateAgg implements Aggregate {
+	+Iterator createIterator()
+}
+
+class ConcreateIter implements Iterator {
+	+Object next()
+    +boolean hasNext()
+}
+
+class Client
+
+Aggregate -> Client
+Client -> Iterator
+ConcreateAgg -> ConcreateIter
+@enduml
+```
+
+{% plantuml %}
+@startuml
@@ -381,33 +466,3 @@ public class IteratorClient {
-* ConcreateAggregate 到 ConcreateIterator 是实线普通三角，表示拥有，回想一下 DinerHouse 是需要返回 DinerHouseMenuIterator 来做遍历的
-* Client 对两个 interface 也是 实线普通三角，也是表示拥有
-
-```txt
-+------------------+                              +--------------------+                                                                             
-|  <<interface>>   |         +-----------+        |   <<interface>>    |                                                                             
-|    Aggregate     |<--------|  Client   |------> |      Iterator      |                                                                             
-|------------------|         |           |        |--------------------|                                                                             
-| createIterator() |         +-----------+        | hasNext()          |                                                                             
-|                  |                              | next()             |                                                                             
-+------------------+                              | remove()           |                                                                             
-        ^                                         +--------------------+                                                                             
-        |                                                     ^                                                                                      
-        |                                                     |                                                                                      
-        |                                                     |                                                                                      
-        |                                                     |                                                                                      
-+--------------------+                            +--------------------+                                                                             
-| ConcreateAggregate |--------------------------->| ConcreateIterator  |                                                                             
-|--------------------|                            |--------------------|                                                                             
-| createIterator()   |                            | hasNext()          |                                                                             
-|                    |                            | next()             |                                                                             
-+--------------------+                            | remove()           |                                                                             
-                                                  +--------------------+                                                                             
-```
